{"meta":{"title":"기억하지 못할 메모","subtitle":"Notes Can't Remeber.","description":null,"author":"변상필","url":"http://sangpire.github.io","root":"/"},"pages":[{"title":"","date":"2018-02-18T15:00:04.000Z","updated":"2018-04-10T15:42:55.703Z","comments":true,"path":"codes/index.html","permalink":"http://sangpire.github.io/codes/index.html","excerpt":"","text":"Shell Commandspythonlocal Server 띄우기 1python -m SimpleHTTPServer ipfw80 포트로 접근하는 요청을 8080 으로 1sudo ipfw add 100 fwd 127.0.0.1,8080 tcp from any to any 80 in nc클라이언트의 파일을 서버로 업로드 12SERVER$ nc -l -p 9999 &gt; file.txtCLIENT$ nc SERVER-IP-ADDRESS 9999 &lt; file.txt uname32bit 인지 64bit 알고자 할 때 1$ uname -i awkaccess log 중 응답 코드가 200 도 304도 302 도 아닌 로그 출력. 1$ tail -f access.log | awk &#x27;&#123;if ($9 !~ /200|304|302/) print $0&#125;&#x27; gitgit tag 삭제 12git tag -d 12345git push origin :refs/tags/12345"},{"title":"Sites","date":"2017-03-28T03:35:13.000Z","updated":"2017-04-01T06:40:48.224Z","comments":true,"path":"sites/index.html","permalink":"http://sangpire.github.io/sites/index.html","excerpt":"","text":"http://realfavicongenerator.net/Favicon 생성해주는 웹 서비스"},{"title":"","date":"2017-04-08T15:23:16.000Z","updated":"2018-07-18T15:16:29.398Z","comments":true,"path":"thinking/index.html","permalink":"http://sangpire.github.io/thinking/index.html","excerpt":"","text":"무언가를 비판하기 전에 과연 타당한 비판인지 비판적으로 살펴보자. - 2018. 07. 19 머릿속에서 타당한 구조가 떠오르기 전에, 코드부터 작성하는 버릇은 고쳐야겠다, - 2012. 11. 05 바쁘다고 아무 것 도 하지 않으면 아무 것 도 변하지 않겠지? - 2017. 5. 29 왜 늘 똑같이 행동하면서 다른 결과를 바라는가? - 아인슈타인 주변을 잘 정리해 놓자. - 2017. 4. 9 가장 쉬운 정리는 버리고 잊는 것이다."}],"posts":[{"title":"문제는 나 인 것 같아.","slug":"the-problem-seems-to-be-me","date":"2022-09-08T15:08:45.000Z","updated":"2022-09-08T15:38:53.399Z","comments":true,"path":"2022/09/09/the-problem-seems-to-be-me/","link":"","permalink":"http://sangpire.github.io/2022/09/09/the-problem-seems-to-be-me/","excerpt":"","text":"Nuphy Air 75 맥 환경에서 ‘F5’, ‘F6’ 키가 동작하지 않는 버그 발견 지금(2022.09.09)까지 나온 펌웨어를 설치해도 해결되지 않는다. 현재 방법은 ‘Win’모드로 하고, Opt 키와 Cmd 키를 바꿔서 매핑해서 사용중, 이게 가능한 이유는, ‘Win’ 모드에선 ‘F5’, ‘F6’이 입력이 되고 있기 때문(그나마 다행) AS 센터에 연락해보니, 이미 알고 있는 이슈이며, 엔지니어가 고치기 위해 노력하고 있다고, 이거 엄청 어려운 이슈인가?? 보다. 오늘도 깊게 다운되어 있었어아무래도 ‘문제는 나 인 것 같아.’ 추석 연휴 동안 Graph QL 을 공부해 봐야겠다굉장히 심플해 보여서 바로 코드에 적용해 보고 있었는데, 개발 중 ‘F6’이 동작하지 않는 다는 사실을 알게 되었다!! :cry: Nuphy Console 을 설치한 뒤, 윈도우에서도 Caps Lock 키를 ‘한&#x2F;영’ 으로 맵핑해서 사용하게 되었다. 위 이미지 처럼 ‘CAPS’ 키를 누르고, Modify에 오른쪽 ‘Shift’, Adv에 ‘Space’를 셋팅! 참고로 기존에 한영 전환은 ‘Shift + Space’ 를 이용하고 있었음","categories":[],"tags":[]},{"title":"키 스위치를 청축으로 갈다...","slug":"2022-09-06","date":"2022-09-06T12:24:51.000Z","updated":"2022-09-08T14:54:17.817Z","comments":true,"path":"2022/09/06/2022-09-06/","link":"","permalink":"http://sangpire.github.io/2022/09/06/2022-09-06/","excerpt":"","text":"오늘 뭔가 프로젝트가 삐걱 거리고 있는것 같다는 느낌을 받았다.어의 없겠지만, 그냥 느낌이 그랬다. 왤일까? 무엇이 그런 기분을 들게 한건지 꾸역꾸역 생각 해보자!! ‘업무 공유’를 하고 있지만, 진척도를 알지 못하는것!이건 진척도를 알 수 없는 것이 아니라, 사실 PM으로서 내가 진척이 얼마나 된 건지 생각해 보지 않아서 인 듯 하다!! Vim 에도 자동저장 기능이 있으면 좋겠다.(한번 찾아봐야지…)-&gt; 역시 있다! vim-auto-save설정 파일에 Plug 추가하고, 1Plug &#x27;907th/vim-auto-save&#x27; 플러그인 설치 후, 아래 명령으로 켜고 끌 수 있다. GOOD!! 1:AutoSaveToggle Tmux Pane 크기 조절 방법을 찾아봐야겠다.Tmux 도 새 노트북 받으면서 셋팅을 하나도 가져오지 않아서 Pane 이라고 하나? 크기 조절도 어떻게 하는지 모르겠다,(이 것 도 찾아볼 것!!) 치매 예방으로 다른사람이 올린 코드를 꾸역꾸역 이해하기 위해 노력을 해봐야겠다. GraphQL 이 뭔지 너무 모르는 것 같으니 HelloWorld 수준으로 뭐 하나 만들어 보면 좋을 것 같다. Vim 커멘드 노멀 모드에서 알아서 ‘영문’으로 바뀌게 하는 방법도 찾아봐야 할 듯아래 블로그에서 방법을 찾아 적용 완료!!VIM에서 ESC키 눌렀을때 자동으로 영문 전환하기 Hexo 글 발행 방법도 모르겠음","categories":[],"tags":[]},{"title":"프로젝트, findup (진행중)","slug":"findup","date":"2017-05-10T14:27:38.000Z","updated":"2017-05-29T15:02:27.908Z","comments":true,"path":"2017/05/10/findup/","link":"","permalink":"http://sangpire.github.io/2017/05/10/findup/","excerpt":"","text":"사진이 참 많아졌다. 백업하다 다시 가져오고 하다보니, 중복도 많아지고, 파일을 정리할 수 있는 프로그램을 개발해 보고 싶었다. 프로젝트 명 find (d)up(lications)깃헙 주소: https://github.com/sangpire/findup 글을 쓰기로 한 현재 상태는..특정 폴더(File 객체)를 인자로 넘겨주면, 해당 폴더의 파일을 모두 나열하고 있는 상태. 즉, 아래 함수 하나 정도 만들어져 있다. 1234567891011121314151617181920void lookupDir(Integer depth, File dir) &#123; if (depth &gt; 1) &#123; return; &#125; String margin = String.join(&quot;&quot;, Collections.nCopies(depth, &quot; &quot;)); File[] childFileList = dir.listFiles(); if (childFileList == null) &#123; String fileMetaInfos =String.format(&quot;%sEmpty!?\\n&quot;, margin); System.out.print(fileMetaInfos); return; &#125; for(File file: childFileList) &#123; String fileMetaInfos =String.format(&quot;%s%s - %s\\n&quot;, margin, file.isDirectory() ? &quot;d&quot; : &quot;-&quot; , file.getAbsolutePath()); System.out.print(fileMetaInfos); if (file.exists() &amp;&amp; file.isDirectory()) &#123; lookupDir(depth + 1, file); &#125; &#125;&#125; 여기까지 - 2017. 5. 10 역할에 따른 코드 분리.추가로 수정하고 싶은 부분 파일만 전문적으로 가져오는 부분을 만들어 보자. 실제로 뭔가를 할 녀석을 추상화 해서 만들어보자. 메서드로는 다음과 같은게 필요하지 않을까? (필터링) 이 파일 있는데 너 관심 있니? (액션) 이 파일이 그 파일이야. 지지고 볶고 하삼. 적고보니,.. 뭔가 할 녀석은. 이 파일 있어 필요하면 쓰고 관심 밖이면 안써도 괜찮아. 도 충분할 듯. 여기까지 해보자.그 전에 우선 파일명도 좀 바꾸고, 테스트 좀 더 쉽게 실행할 수 있도록 테스트 코드도 추가했다. 커밋 적용 완료. 커밋 - 2017. 5. 11","categories":[],"tags":[]},{"title":"Hello Hexo","slug":"hello-hexo","date":"2017-03-27T15:00:00.000Z","updated":"2018-02-12T15:31:49.035Z","comments":true,"path":"2017/03/28/hello-hexo/","link":"","permalink":"http://sangpire.github.io/2017/03/28/hello-hexo/","excerpt":"","text":"hexo 를 처음 시작할 때 기본적으로 존재하는 글.에서 새롭게 알게 된 것들을 채워보자. Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment 추가로 설치한 플러그인 hexo-browsersync","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://sangpire.github.io/tags/hexo/"}]},{"title":"socat 명령어","slug":"socat","date":"2016-10-06T15:00:00.000Z","updated":"2017-03-25T15:47:14.064Z","comments":true,"path":"2016/10/07/socat/","link":"","permalink":"http://sangpire.github.io/2016/10/07/socat/","excerpt":"","text":"로컬 파일을 서버로 전송하려고 하니 socat이 가장 먼저 생각이 났습니다.socat 은 Multipurpose relay (SOcket CAT) 이라고 합니다. ‘다목적 중계기’ !? 원래 사용한적이 있던 명령어지만 또 까먹어서 사용 방법을 찾아봅니다. 우선 tldr 로 사용방법을 살펴봅니다. 1234567891011121314$ tldr socatsocatMultipurpose relay (SOcket CAT).- Listen to a port, wait for an incoming connection and transfer data to STDIO: socat - TCP-LISTEN:8080,fork- Create a connection to a host and port, transfer data in STDIO to connected host: socat - TCP4:www.domain.com:80- Forward incoming data of a local port to another host and port: socat TCP-LISTEN:80,fork TCP4:www.domain.com:80 난 파일을 전송하고 싶은건데 큰 도움이 안되니, man 페이지를 살펴봅니다. 우선 OPTIONS 중 -u Uses unidirectional mode. The first address is only used for reading, and the second address is only used for writing (example). 단방향 모드, 첫번째 주소 -&gt; 두번째 주소 -U Uses unidirectional mode in reverse direction. The first address is only used for writing, and the second address is only used for reading. 단방향 모드, 첫번째 주소 &lt;- 두번째 주소 다음은, ADDRESS TYPES 중주소를 작성하는 방식들 우선 ‘파일’ 관련된 녀석들만 읽어봅니다. 첫번째, CREATE:&lt;filename&gt; ADDRESS TYPE Opens &lt;filename&gt; with creat() and uses the file descriptor for writing. This address type requires write-only context, because a file opened with creat cannot be read from. 쓰기 전용으로만 쓰일 수 있는 주소인가 봅니다. Flags like O_LARGEFILE cannot be applied. If you need them use OPEN with options create,create. create,create 오타인가?.. &lt;filename&gt; must be a valid existing or not existing path. If &lt;filename&gt; is a named pipe, creat() might block; if &lt;filename&gt; refers to a socket, this is an error. Option groups: FD,REG,NAMED Useful options: mode, user, group, unlink-early, unlink-late, append See also: OPEN, GOPEN 두번째, GOPEN:&lt;filename&gt; ADDRESS TYPE (Generic open) This address type tries to handle any file system entry except directories usefully. &lt;filename&gt; may be a relative or absolute path.If it already exists, its type is checked. In case of a UNIX domain socket, socat connects; if connecting fails, socat assumes a datagram socket and uses sendto() calls.If the entry is not a socket, socat opens it applying the O_APPEND flag.If it does not exist, it is opened with flag O_CREAT as a regular file(example). Option groups: FD,REG,SOCKET,NAMED,OPEN See also: OPEN, CREATE, UNIX-CONNECT directories 를 제외하고 일반적인 파일 시스템 엔트리(&#x3D; 무엇을 의미하는 걸까요?) 에 유용하다고 하네요. &lt;filename&gt; 이 존재하면 뒤에 내용을 덧붙히고, 없으면 만들어주나 봅니다. 세번째, OPEN:&lt;filename&gt; ADDRESS TYPE Opens &lt;filename&gt; using the open() system call (example). This operation fails on UNIX domain sockets. Note: This address type is rarly useful in bidirectional mode. Option groups: FD,REG,NAMED,OPEN Useful options: creat, excl, noatime, nofollow, append, rdonly, wronly, lock, readbytes, ignoreeof See also: CREATE, GOPEN, UNIX-CONNECT 오타 발견 ‘rarly’!! 양방향 모드에선 거의 유용하지 않다고 합니다. 결론결과적으로 파일을 보내고자 하는 서버와 클라이언트 에서 실행한 명령어는 다음과 같습니다. 서버에서, GOPEN을 사용했지만, OPEN 을 써도 될 듯. 1$ socat -u GOPEN:./source.file TCP:192.168.0.1:9999 클라이언트에서, 1$ socat -u TCP-LISTEN:9999 CREATE:target.file","categories":[],"tags":[]},{"title":"nvm 으로 node 설치하기.","slug":"node-install","date":"2013-08-10T15:00:00.000Z","updated":"2017-03-25T16:48:04.000Z","comments":true,"path":"2013/08/11/node-install/","link":"","permalink":"http://sangpire.github.io/2013/08/11/node-install/","excerpt":"","text":"ruby 에 rvm 이 있고, perl 에 perlbrew 가 있는 것 처럼 node 에도 nvm 이 있더군요. 우선 홈페이지에 설명대로, 설치 스크립트를 실행하였습니다. 1curl https://raw.github.com/creationix/nvm/master/install.sh | sh 설치하고 나면, .bash_profile 에 다음과 같은 명령이 추가된 것을 확인할 수 있습니다. 1[[ -s /Users/sangpire/.nvm/nvm.sh ]] &amp;&amp; . /Users/sangpire/.nvm/nvm.sh # This loads NVM 그리고, 설정 파일 적용을 위해, 터미널을 재시작 본격적인 nvm 실행.우선 nvm 명령을 실행하면, 다음과 같은 도움말이 나타납니다. 1234567891011121314151617181920212223242526rosebook:Vibration sangpire$ nvmNode Version ManagerUsage: nvm help Show this message nvm install [-s] &lt;version&gt; Download and install a &lt;version&gt; nvm uninstall &lt;version&gt; Uninstall a version nvm use &lt;version&gt; Modify PATH to use &lt;version&gt; nvm run &lt;version&gt; [&lt;args&gt;] Run &lt;version&gt; with &lt;args&gt; as arguments nvm ls List installed versions nvm ls &lt;version&gt; List versions matching a given description nvm ls-remote List remote versions available for install nvm deactivate Undo effects of NVM on current shell nvm alias [&lt;pattern&gt;] Show all aliases beginning with &lt;pattern&gt; nvm alias &lt;name&gt; &lt;version&gt; Set an alias named &lt;name&gt; pointing to &lt;version&gt; nvm unalias &lt;name&gt; Deletes the alias named &lt;name&gt; nvm copy-packages &lt;version&gt; Install global NPM packages contained in &lt;version&gt; to current versionExample: nvm install v0.4.12 Install a specific version number nvm use 0.2 Use the latest available 0.2.x release nvm run 0.4.12 myApp.js Run myApp.js using node v0.4.12 nvm alias default 0.4 Auto use the latest installed v0.4.x versionrosebook:Vibration sangpire$ 이 명령중, ls-remote 로 설치 가능한 버전을 확인하고, install 로 설치하면 완료. 1nvm install 0.10 현재 ls-remote 명령을 실행하면, v0.11.5 까지 나타나지만, 설치해서 npm 으로 모듈을 설치하려 하니 오류가 좀 있어서, v0.10 을 설치 했습니다. (홈페이지에도, 현재 버전이 v0.10.15 라고 나오더군요.) 설치 하고, v0.10.x 를 사용하겠다고 아래와 같이 입력하면 설정 완료. 1nvm use 0.10 설명 마지막에 있는 것처럼 alias 도 설정해 보고, 1nvm alias default 0.11 재미난 모듈들을 설치해보면 끝!.","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://sangpire.github.io/tags/hexo/"}]}